config.org
#+Title: Yay-Evil distro by Ian Y.E. Pan
#+Author: Ian Y.E. Pan
#+Date: 2019
Welcome! This Emacs "distro" is based on my personal Emacs configuration (on GNU Emacs 26.3). It's unopinionated and was created for general use in mind. The package settings are grouped in a logical manner, and I've documented as detailed as possible what each code snippet does in this file.
* Settings without corresponding packages
Clean up the UI and enhance some basic defaults defined in "C Source Code". The variable ~ian/indent-width~ controls the default indentation across various programming modes. The default is 4, you can change this variable to 2 or any other indentation width you prefer, and the change will be made across all programming language modes including C, C++, Java, JavaScript, Python etc.
#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :preface
    (defvar ian/indent-width 4)      ; change this value to your preferred width
    :bind
    ("C-+" . text-scale-increase)
    ("C--" . text-scale-decrease)
    :config
    (setq frame-title-format "%b"    ; set to bufer title name
          ring-bell-function 'ignore ; minimise distraction
          frame-resize-pixelwise t
          default-directory "~/")

    (tool-bar-mode -1)
    (menu-bar-mode 1)                ; menu-bar on, I like it this way

    ;; better scrolling experience
    (setq scroll-margin 0
          scroll-conservatively 10000
          scroll-preserve-screen-position t
          auto-window-vscroll nil)

    ;; increase line space for better readability
    (setq-default line-spacing 3)

    ;; Always use spaces for indentation
    (setq-default indent-tabs-mode nil
                  tab-width ian/indent-width))
#+END_SRC
* Map fn to Hyper, CMD to Super
#+source: fn-to-hyper
#+begin_src emacs-lisp :tangle no
  ;; from  kjkeayl's config, however the remainder below at this stage not required
  ;; set keys for Apple keyboard, for emacs in OS X
  (setq ns-command-modifier 'super) ; make cmd key do Super
  ;; (setq mac-option-modifier 'super) ; make opt key do Super
  ;; (setq mac-control-modifier 'control) ; make Control key do Control
  (setq ns-function-modifier 'hyper)  ; make Fn key do Hyper

  ;; fix page-up and page-down keys

  ;; (defun sfp-page-down (&optional arg)
  ;;   (interactive "^P")
  ;;   (setq this-command 'next-line)
  ;;   (next-line
  ;;    (- (window-text-height)
  ;;       next-screen-context-lines)))
  ;; (put 'sfp-page-down 'isearch-scroll t)
  ;; (put 'sfp-page-down 'CUA 'move)

  ;; (defun sfp-page-up (&optional arg)
  ;;   (interactive "^P")
  ;;   (setq this-command 'previous-line)
  ;;   (previous-line
  ;;    (- (window-text-height)
  ;;       next-screen-context-lines)))
  ;; (put 'sfp-page-up 'isearch-scroll t)
  ;; (put 'sfp-page-up 'CUA 'move)

  ;; (global-set-key [(H down)] 'scroll-up)
  ;; (global-set-key [(H up)]   'scroll-down)
  ;; (use-package scroll-lock
  ;;   :init
  ;;   (setq scroll-preserve-screen-position t))

#+end_src
* Configuration for built-in packages
Since we're using use-package as our package management system, we might as well try to organise under the same syntax as much as possible to keep the configuration consistent. The option ~use-package-always-ensure~ is turned on in ~init.el~, so we'll add ~:ensure nil~ when configuring the built-in packages.
** Undo-Tree
I think this is important to have upfront, so that it does not conflict with other keybindings, particularly the R-IDE pipe and assign operators.
#+source: undo-tree
#+begin_src emacs-lisp
   (eval-after-load 'undo-tree
    '(progn
       (define-key undo-tree-map (kbd "C-/") nil)
       (define-key undo-tree-map (kbd "C-_") nil)
       (define-key undo-tree-map (kbd "C-?") nil)
       (define-key undo-tree-map (kbd "M-_") nil)
       (define-key undo-tree-map (kbd "C-z") 'undo-tree-undo)
       (define-key undo-tree-map (kbd "C-S-z") 'undo-tree-redo)))

  (use-package undo-tree
    :config
    (global-undo-tree-mode 1))
#+end_src
** Omit default startup screen
#+BEGIN_SRC emacs-lisp
  (use-package "startup"
    :ensure nil
    :config (setq inhibit-startup-screen t))
#+END_SRC
** Modernise selection behaviour
Replace the active region just by typing text, just like modern editors
#+BEGIN_SRC emacs-lisp
  (use-package delsel
    :ensure nil
    :config (delete-selection-mode +1))
#+END_SRC
** Disable scroll-bar
#+BEGIN_SRC emacs-lisp
  (use-package scroll-bar
    :ensure nil
    :config (scroll-bar-mode -1))
#+END_SRC
** Enable column numbers
#+BEGIN_SRC emacs-lisp
  (use-package simple
    :ensure nil
    :config (column-number-mode +1))
#+END_SRC
** Split right and split below
The Emacs default split doesn't seem too intuitive for the majority of users.
#+BEGIN_SRC emacs-lisp
  (use-package "window"
    :ensure nil
    :preface
    (defun ian/split-and-follow-horizontally ()
      "Split window below."
      (interactive)
      (split-window-below)
      (other-window 1))
    (defun ian/split-and-follow-vertically ()
      "Split window right."
      (interactive)
      (split-window-right)
      (other-window 1))
    :config
    (global-set-key (kbd "C-x 2") #'ian/split-and-follow-horizontally)
    (global-set-key (kbd "C-x 3") #'ian/split-and-follow-vertically))
#+END_SRC
** File-related tweaks
Don't bother confirming killing processes and don't let backup~ files scatter around
#+BEGIN_SRC emacs-lisp
  (use-package files
    :ensure nil
    :config
    (setq confirm-kill-processes nil
          make-backup-files nil))
#+END_SRC
** Automatically refreshes the buffer for changes outside of Emacs
Auto refreshes every 2 seconds. Don't forget to refresh the version control status as well.
#+BEGIN_SRC emacs-lisp
  (use-package autorevert
    :ensure nil
    :config
    (global-auto-revert-mode +1)
    (setq auto-revert-interval 2
          auto-revert-check-vc-info t
          global-auto-revert-non-file-buffers t
          auto-revert-verbose nil))
#+END_SRC
** Eldoc: documentation in the mini-buffer
Only use eldoc in prog-mode (by defaults it's turned on globally, but reports say it hinders performance).
#+BEGIN_SRC emacs-lisp
  (use-package eldoc
    :ensure nil
    :diminish eldoc-mode
    :config
    (global-eldoc-mode +1)
    (setq eldoc-idle-delay 0.4))
#+END_SRC
** Indentation improvement
For Java and C/C++, change the formatting style from GNU (the default) to the more standard K&R. Here we also set the indentation width of C, C++, Java, JavaScript, and Python to the preferred value defined in ~ian/indent-width~. Of course, you can change the value depending on the language as well.
#+BEGIN_SRC emacs-lisp
  ;; C, C++, and Java
  (use-package cc-vars
    :ensure nil
    :config
    (setq-default c-basic-offset ian/indent-width)
    (setq c-default-style '((java-mode . "java")
                            (awk-mode . "awk")
                            (other . "k&r"))))

  ;; JavaScript
  (use-package js
    :ensure nil
    :config (setq js-indent-level ian/indent-width))

  ;; Python (both v2 and v3)
  (use-package python
    :ensure nil
    :config (setq python-indent-offset ian/indent-width))
#+END_SRC
** Mouse wheel (track-pad) scroll speed
By default, the scrolling is way too fast to be precise and helpful, let's tune it down a little bit.
#+BEGIN_SRC emacs-lisp
  (use-package mwheel
    :ensure nil
    :config (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))
                  mouse-wheel-progressive-speed nil))
#+END_SRC
** Show matching parentheses
Reduce the highlight delay to instantly.
#+BEGIN_SRC emacs-lisp
  (use-package paren
    :ensure nil
    :init (setq show-paren-delay 0)
    :config (show-paren-mode +1))

  ;; jump to mathcing paren
  (global-set-key (kbd "C-M-f") 'forward-sexp)
  (global-set-key (kbd "C-M-b") 'backward-sexp)
#+END_SRC
** Setting up some frame defaults
Maximise the frame by default on start-up. Set the font to Menlo size 13, if Menlo is installed.
#+BEGIN_SRC emacs-lisp
  (use-package frame
    :ensure nil
    :config
    (setq initial-frame-alist (quote ((fullscreen . maximized))))
    (when (member "Menlo" (font-family-list))
      (set-frame-font "menlo-13:weight=regular" t t)))
#+END_SRC
** Ediff tweaks
Enter ediff with side-by-side buffers to better compare the differences.
#+BEGIN_SRC emacs-lisp
  (use-package ediff
    :ensure nil
    :config (setq ediff-split-window-function 'split-window-horizontally))
#+END_SRC
** Auto-pairing quotes and parentheses etc.
Electric-pair-mode has improved quite a bit in recent Emacs versions. No longer need an extra package for this. It also takes care of the new-line-and-push-brace feature.
#+BEGIN_SRC emacs-lisp
  (use-package elec-pair
    :ensure nil
    :hook (prog-mode . electric-pair-mode))
#+END_SRC
** Clean up whitespace on save
#+BEGIN_SRC emacs-lisp
  (use-package whitespace
    :ensure nil
    :hook (before-save . whitespace-cleanup))
#+END_SRC
