config.org
*** Org Mode
Some minimal org mode tweaks: org-bullets gives our headings (h1, h2, h3...) a more visually pleasing look.
#+BEGIN_SRC emacs-lisp
  (use-package org
    :init
    (setq org-support-shift-select t) ; could be okay or not
    (setq org-src-tab-acts-natively t)
    :hook ((org-mode . visual-line-mode)
           (org-mode . org-indent-mode))
    ;; :bind ("\C-cl" . org-store-link) ; not using, but taken from kjhealy's setup
    )
  (use-package org-bullets :hook (org-mode . org-bullets-mode))
#+END_SRC
*** Yasnippet & yasnippet-snippets
Use TAB to expand snippets. The code snippet below also avoids clashing with company-mode.
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :diminish yas-minor-mode
    :preface (defvar tmp/company-point nil)
    :config
    (yas-global-mode +1)
    (advice-add 'company-complete-common
                :before
                #'(lambda ()
                    (setq tmp/company-point (point))))
    (advice-add 'company-complete-common
                :after
                #'(lambda ()
                    (when (equal tmp/company-point (point))
                      (yas-expand)))))

  (use-package yasnippet-snippets)
#+END_SRC
*** Useful major modes
Markdown mode and JSON mode
#+BEGIN_SRC emacs-lisp
  ;; This has been loaded via the atanas.org file
  ;; (use-package markdown-mode :hook (markdown-mode . visual-line-mode))

  (use-package json-mode)
#+END_SRC
** Miscellaneous
*** Diminish minor modes
The diminish package is used to hide unimportant minor modes in the modeline. It provides the ~:diminish~ keyword we've been using in other use-package declarations.
#+BEGIN_SRC emacs-lisp
  (use-package diminish
    :demand t)
#+END_SRC
*** Which-key
Provides us with hints on available keystroke combinations.
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :diminish which-key-mode
    :config
    (which-key-mode +1)
    (setq which-key-idle-delay 0.4
          which-key-idle-secondary-delay 0.4))
#+END_SRC
*** Configure PATH on macOS
#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :config (when (memq window-system '(mac ns x))
              (exec-path-from-shell-initialize)))
#+END_SRC

* Atanas' tweaks
** Function for loading/compiling starter-kit-*

#+srcname: set load path
#+begin_src emacs-lisp
  ;; this has been included for simplicity, however may need something more complex
  (org-babel-load-file (expand-file-name "~/.emacs.d/lisp/atanas.org")) ; for my custom settings
  ;; for custom lisp files from github or similar
  (add-to-list 'load-path (expand-file-name "~/.emacs.d/src")) ; test to make sure this is working

  ;;; Commentary:
  ;; this is taken form the plain text starter kit
  ;;; Code:
  ;; (setq dotfiles-dir (file-name-directory (or (buffer-file-name) load-file-name)))
  ;; (setq dotfiles-dir (file-name-directory (or load-file-name (buffer-file-name))))
  ;; (add-to-list 'load-path
  ;; (expand-file-name "lisp" dotfiles-dir
  ;; (expand-file-name "org"
  ;; (expand-file-name "src" dotfiles-dir))))

#+end_src
