config.el
  (setq org-support-shift-select t) ; could be okay or not
  (setq org-src-tab-acts-natively t)
  :hook ((org-mode . visual-line-mode)
         (org-mode . org-indent-mode))
  ;; :bind ("\C-cl" . org-store-link) ; not using, but taken from kjhealy's setup
  )
(use-package org-bullets :hook (org-mode . org-bullets-mode))

(use-package yasnippet
  :diminish yas-minor-mode
  :preface (defvar tmp/company-point nil)
  :config
  (yas-global-mode +1)
  (advice-add 'company-complete-common
              :before
              #'(lambda ()
                  (setq tmp/company-point (point))))
  (advice-add 'company-complete-common
              :after
              #'(lambda ()
                  (when (equal tmp/company-point (point))
                    (yas-expand)))))

(use-package yasnippet-snippets)

;; This has been loaded via the atanas.org file
;; (use-package markdown-mode :hook (markdown-mode . visual-line-mode))

(use-package json-mode)

(use-package diminish
  :demand t)

(use-package which-key
  :diminish which-key-mode
  :config
  (which-key-mode +1)
  (setq which-key-idle-delay 0.4
        which-key-idle-secondary-delay 0.4))

(use-package exec-path-from-shell
  :config (when (memq window-system '(mac ns x))
            (exec-path-from-shell-initialize)))

;; this has been included for simplicity, however may need something more complex
(org-babel-load-file (expand-file-name "~/.emacs.d/lisp/atanas.org")) ; for my custom settings
;; for custom lisp files from github or similar
(add-to-list 'load-path (expand-file-name "~/.emacs.d/src")) ; test to make sure this is working

;;; Commentary:
;; this is taken form the plain text starter kit
;;; Code:
;; (setq dotfiles-dir (file-name-directory (or (buffer-file-name) load-file-name)))
;; (setq dotfiles-dir (file-name-directory (or load-file-name (buffer-file-name))))
;; (add-to-list 'load-path
;; (expand-file-name "lisp" dotfiles-dir
;; (expand-file-name "org"
;; (expand-file-name "src" dotfiles-dir))))
